In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
import os
print("Current Working Directory " , os.getcwd())

Current Working Directory  c:\Users\URM08A\Desktop\CSR

In [5]:
#Windows path
os.chdir('C:/Users/URM08A/Desktop/ESG_Ref_Bloom')

In [6]:
#import data
df_bloom = pd.read_excel(r'ESG_Combined.xlsx', sheet_name='ESG_dis_bloom')
print(df_bloom)

               ISIN  Year esg_dis
0      US0003602069  2001       .
1      US0003602069  2002       .
2      US0003602069  2003       .
3      US0003602069  2004       .
4      US0003602069  2005       .
...             ...   ...     ...
64543  US98986T1088  2018       .
64544  US98986T1088  2019       .
64545  US98986T1088  2020       .
64546  US98986T1088  2021       .
64547  US98986T1088  2022       .

[64548 rows x 3 columns]

In [7]:
#import data
df_id = pd.read_excel(r'us.xlsx')
print(df_id)

              ISIN   IBTKR                                     NAME     SECD  \
0     AN8068571086   @:SLB                             SCHLUMBERGER  2779201
1     BMG0129K1045   @:AYR                                AIRCASTLE  B1BDJQ3
2     BMG0450A1053  @:RISK                             ARCH CAP.GP.  2740542
3     BMG0464B1072  @:PXRE                    ARGO GP.INTL.HOLDINGS  2499543
4     BMG053841547     NaN  ASPEN IN.HDG.5.95% NON-CUM.PERP.PF.SHS.  B94QMV1
...            ...     ...                                      ...      ...
3068  VGG0443N1078  @:WAAS                     AQUAVENTURE HOLDINGS  BYVZDC4
3069  VGG0457F1071  @:ARCD                   ARCOS DORADOS HOLDINGS  B529PQ0
3070  VGG111961055  @:BHVN          BIOHAVEN PHARMACEUTICAL HOLDING  BZ8FXC4
3071  VGG1890L1076  @:KORS                           CAPRI HOLDINGS  BJ1N1M9
3072  VGG872101032  @:UTIW     UTI WORLDWIDE DEAD - DELIST.25/01/16  2676368

     Ticker (I/B/E/S)
0                 SLB
1                 AYR
2                ACGL
3                ARGO
4                 NaN
...               ...
3068             WAAS
3069             ARCO
3070             BHVN
3071             CPRI
3072             UTIW

[3073 rows x 5 columns]

## Merge

In [8]:
result = pd.merge(df_bloom, df_id, how="left", on=["ISIN"])

In [9]:
result

               ISIN  Year esg_dis   IBTKR       NAME     SECD Ticker (I/B/E/S)
0      US0003602069  2001       .  @:AAON       AAON  2268130             AAON
1      US0003602069  2002       .  @:AAON       AAON  2268130             AAON
2      US0003602069  2003       .  @:AAON       AAON  2268130             AAON
3      US0003602069  2004       .  @:AAON       AAON  2268130             AAON
4      US0003602069  2005       .  @:AAON       AAON  2268130             AAON
...             ...   ...     ...     ...        ...      ...              ...
64543  US98986T1088  2018       .  @:ZNGA  ZYNGA 'A'  B79PX49             ZNGA
64544  US98986T1088  2019       .  @:ZNGA  ZYNGA 'A'  B79PX49             ZNGA
64545  US98986T1088  2020       .  @:ZNGA  ZYNGA 'A'  B79PX49             ZNGA
64546  US98986T1088  2021       .  @:ZNGA  ZYNGA 'A'  B79PX49             ZNGA
64547  US98986T1088  2022       .  @:ZNGA  ZYNGA 'A'  B79PX49             ZNGA

[64548 rows x 7 columns]

In [10]:
#import data
esg_ref = pd.read_excel(r'ESG_Combined.xlsx', sheet_name='ESG_Refinitiv')
print(esg_ref)

               ISIN  Year  ESG Score ESG Combined Score  \
0      US0003602069  2014          .                  .
1      US0003602069  2015     16.998             16.998
2      US0003602069  2016  18.489685          18.489685
3      US0003602069  2017  18.874563          18.874563
4      US0003602069  2018  23.644815          23.644815
...             ...   ...        ...                ...
20820  US98986T1088  2015  19.508535          19.508535
20821  US98986T1088  2016   17.66555           17.66555
20822  US98986T1088  2017  27.932478          27.932478
20823  US98986T1088  2018  30.544914          30.544914
20824  US98986T1088  2019  41.311857          38.837746

      ESG Controversies Score Social Pillar Score Governance Pillar Score  \
0                           .                   .                       .
1                         100           27.270129               23.927696
2                         100            28.99138               26.908419
3                         100           29.631952               27.419905
4                         100           29.809628               37.768924
...                       ...                 ...                     ...
20820                     100             35.6181               11.488971
20821                     100           36.574732                6.682309
20822                     100           37.715467                27.88798
20823                     100           38.566075               32.801278
20824               36.363636           37.434598               57.044164

      Environmental Pillar Score
0                              .
1                              0
2                              0
3                              0
4                       5.139094
...                          ...
20820                          0
20821                          0
20822                          0
20823                          0
20824                          0

[20825 rows x 8 columns]

In [11]:
result1 = pd.merge(result, esg_ref, how="left", on=["ISIN", "Year"])

In [12]:
result1

,ISIN,Year,esg_dis,IBTKR,NAME,SECD,Ticker (I/B/E/S),ESG Score,ESG Combined Score,ESG Controversies Score,Social Pillar Score,Governance Pillar Score,Environmental Pillar Score
0,US0003602069,2001,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,NaN,NaN,NaN
1,US0003602069,2002,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,NaN,NaN,NaN
2,US0003602069,2003,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,NaN,NaN,NaN
3,US0003602069,2004,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,NaN,NaN,NaN
4,US0003602069,2005,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
64681,US98986T1088,2018,.,@:ZNGA,ZYNGA 'A',B79PX49,ZNGA,30.544914,30.544914,100,38.566075,32.801278,0
64682,US98986T1088,2019,.,@:ZNGA,ZYNGA 'A',B79PX49,ZNGA,41.311857,38.837746,36.363636,37.434598,57.044164,0
64683,US98986T1088,2020,.,@:ZNGA,ZYNGA 'A',B79PX49,ZNGA,NaN,NaN,NaN,NaN,NaN,NaN
64684,US98986T1088,2021,.,@:ZNGA,ZYNGA 'A',B79PX49,ZNGA,NaN,NaN,NaN,NaN,NaN,NaN
64685,US98986T1088,2022,.,@:ZNGA,ZYNGA 'A',B79PX49,ZNGA,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
#import data
cg_bloom = pd.read_excel(r'ESG_Combined.xlsx', sheet_name='CG_bloom')
print(cg_bloom)

               ISIN  Year Current CEO Chairman Duality  \
0      US0003602069  2014                            .
1      US0003602069  2015                        False
2      US0003602069  2016                        False
3      US0003602069  2017                        False
4      US0003602069  2018                        False
...             ...   ...                          ...
24739  US98986T1088  2015                         True
24740  US98986T1088  2016                         True
24741  US98986T1088  2017                        False
24742  US98986T1088  2018                        False
24743  US98986T1088  2019                        False

      Corporate Governance Board Committee Audit Board Committee  \
0                                        .                     .
1                                     True                  True
2                                     True                  True
3                                     True                  True
4                                     True                  True
...                                    ...                   ...
24739                                 True                  True
24740                                 True                  True
24741                                 True                  True
24742                                 True                  True
24743                                 True                  True

      Compensation Board Committee Board Attendance Number of Board Meetings  \
0                                .                .                        .
1                             True            False                        5
2                             True            False                        5
3                             True            False                        5
4                             True            False                        5
...                            ...              ...                      ...
24739                         True            False                        6
24740                         True            False                        6
24741                         True            False                        6
24742                         True            False                       11
24743                         True            False                        7

      Board Size Average Board Tenure CEO Chairman Duality CEO Board Member  \
0              .                    .                    .                .
1              6             11.90625                False             True
2              7             9.928571                False             True
3              7               9.6875                False             True
4              7            10.714286                False             True
...          ...                  ...                  ...              ...
24739          8                 3.65                 True             True
24740          8               4.6875                 True             True
24741          8                 4.75                 True             True
24742          8               5.5625                 True             True
24743          8               6.5625                 True             True

      Chairman is ex-CEO Board Member Affiliations Board Member Term Duration  \
0                      .                         .                          .
1                  False                         0                          1
2                  False                  0.142857                          1
3                  False                     0.125                          1
4                  False                  0.142857                          1
...                  ...                       ...                        ...
24739               True                       0.8                          1
24740               True                     0.625                          1
24741               True                       0.7                          1
24742               True                     0.625                          1
24743               True                     0.625                          1

      Executive Compensation Policy
0                                 .
1                              True
2                              True
3                              True
4                              True
...                             ...
24739                          True
24740                          True
24741                          True
24742                          True
24743                          True

[24744 rows x 16 columns]

In [15]:
result2 = pd.merge(result1, cg_bloom, how="left", on=["ISIN", "Year"])

In [16]:
result2.head()

,ISIN,Year,esg_dis,IBTKR,NAME,SECD,Ticker (I/B/E/S),ESG Score,ESG Combined Score,ESG Controversies Score,...,Board Attendance_y,Number of Board Meetings_y,Board Size_y,Average Board Tenure_y,CEO Chairman Duality_y,CEO Board Member_y,Chairman is ex-CEO_y,Board Member Affiliations_y,Board Member Term Duration_y,Executive Compensation Policy_y
0,US0003602069,2001,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,US0003602069,2002,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,US0003602069,2003,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,US0003602069,2004,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,US0003602069,2005,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
result2.tail()

,ISIN,Year,esg_dis,IBTKR,NAME,SECD,Ticker (I/B/E/S),ESG Score,ESG Combined Score,ESG Controversies Score,...,Board Attendance_y,Number of Board Meetings_y,Board Size_y,Average Board Tenure_y,CEO Chairman Duality_y,CEO Board Member_y,Chairman is ex-CEO_y,Board Member Affiliations_y,Board Member Term Duration_y,Executive Compensation Policy_y
67523,US98986T1088,2018,.,@:ZNGA,ZYNGA 'A',B79PX49,ZNGA,30.544914,30.544914,100,...,False,11,8,5.5625,True,True,True,0.625,1,True
67524,US98986T1088,2019,.,@:ZNGA,ZYNGA 'A',B79PX49,ZNGA,41.311857,38.837746,36.363636,...,False,7,8,6.5625,True,True,True,0.625,1,True
67525,US98986T1088,2020,.,@:ZNGA,ZYNGA 'A',B79PX49,ZNGA,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
67526,US98986T1088,2021,.,@:ZNGA,ZYNGA 'A',B79PX49,ZNGA,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
67527,US98986T1088,2022,.,@:ZNGA,ZYNGA 'A',B79PX49,ZNGA,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
#import data
cg_ammar = pd.read_excel(r'cg_ammar.xlsx')
print(cg_ammar)

                ISIN  Year         isin_year CGBFDP024 CGBSDP060 CGBSDP061  \
0       AN8068571086  2002  AN80685710862002         6        12         1
1       AN8068571086  2003  AN80685710862003         6         9         1
2       AN8068571086  2004  AN80685710862004         4        10         1
3       AN8068571086  2005  AN80685710862005         5        12         1
4       AN8068571086  2006  AN80685710862006         5        12         1
...              ...   ...               ...       ...       ...       ...
140251  ZW0009011199  2015  ZW00090111992015         5         9         1
140252  ZW0009011199  2016  ZW00090111992016         5         9         1
140253  ZW0009011199  2017  ZW00090111992017         6        11         1
140254  ZW0009011199  2018  ZW00090111992018         5        12         1
140255  ZW0009011199  2019  ZW00090111992019         5        12         1

       CGBSO03V CGBSO06V CGBSO07V CGBSO09V
0         16.67    83.33    33.33        1
1         22.22    88.89       80        1
2            20       90       90        1
3         16.67    91.67    91.67        1
4         16.67    91.67      100        1
...         ...      ...      ...      ...
140251    11.11    77.78        0        0
140252    11.11    77.78        0        0
140253    18.18    83.33        0        0
140254    16.67    83.33        0        0
140255       25    85.71        0        0

[140256 rows x 10 columns]

In [19]:
result3 = pd.merge(result2, cg_ammar, how="left", on=["ISIN", "Year"])

In [20]:
result3.head()

,ISIN,Year,esg_dis,IBTKR,NAME,SECD,Ticker (I/B/E/S),ESG Score,ESG Combined Score,ESG Controversies Score,...,Board Member Term Duration_y,Executive Compensation Policy_y,isin_year,CGBFDP024,CGBSDP060,CGBSDP061,CGBSO03V,CGBSO06V,CGBSO07V,CGBSO09V
0,US0003602069,2001,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,US0003602069,2002,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,US00036020692002,.,.,.,.,.,.,.
2,US0003602069,2003,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,US00036020692003,.,.,.,.,.,.,.
3,US0003602069,2004,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,US00036020692004,.,.,.,.,.,.,.
4,US0003602069,2005,.,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,US00036020692005,.,.,.,.,.,.,.

In [24]:
result3['esg_dis'].isna().sum()

0

In [27]:
#result3.info()
result3.shape

(67528, 49)

In [30]:
result4 = result3.replace('\.+', np.nan, regex=True)

In [31]:
result4.head()

,ISIN,Year,esg_dis,IBTKR,NAME,SECD,Ticker (I/B/E/S),ESG Score,ESG Combined Score,ESG Controversies Score,...,Board Member Term Duration_y,Executive Compensation Policy_y,isin_year,CGBFDP024,CGBSDP060,CGBSDP061,CGBSO03V,CGBSO06V,CGBSO07V,CGBSO09V
0,US0003602069,2001,NaN,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,US0003602069,2002,NaN,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,US00036020692002,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,US0003602069,2003,NaN,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,US00036020692003,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,US0003602069,2004,NaN,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,US00036020692004,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,US0003602069,2005,NaN,@:AAON,AAON,2268130,AAON,NaN,NaN,NaN,...,NaN,NaN,US00036020692005,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [34]:
result4.to_excel('output1.xlsx', engine='xlsxwriter')

In [ ]:
result4.to_excel('output1.xlsx', engine='xlsxwriter')

In [33]:
result4['esg_dis'].isna().sum()

37941

In [35]:
import pandas as pd

# Create an initial panel data frame
panel_data = pd.DataFrame({
    'ID': [1, 1, 2, 2, 3, 3],
    'Time': [2010, 2011, 2010, 2011, 2010, 2011],
    'Variable1': [10, 20, 15, 25, 30, 40],
})

# Create a new variable to append
new_variable = [50, 60, 70, 80, 90, 100]

# Append the new variable to the panel data
panel_data['NewVariable'] = new_variable

# Output the updated panel data
print(panel_data)

   ID  Time  Variable1  NewVariable
0   1  2010         10           50
1   1  2011         20           60
2   2  2010         15           70
3   2  2011         25           80
4   3  2010         30           90
5   3  2011         40          100

In [36]:
import pandas as pd

# Create the initial panel data frame
panel_data = pd.DataFrame({
    'ID': [1, 1, 2, 2, 3, 3],
    'Time': [2010, 2011, 2010, 2011, 2010, 2011],
    'Variable1': [10, 20, 15, 25, 30, 40],
})

In [38]:
panel_data

   ID  Time  Variable1
0   1  2010         10
1   1  2011         20
2   2  2010         15
3   2  2011         25
4   3  2010         30
5   3  2011         40

In [37]:
# Create a new data frame with additional variables
additional_data = pd.DataFrame({
    'ID': [1, 2, 3],
    'Time': [2012, 2012, 2012],
    'Variable2': [50, 60, 70],
    'Variable3': [80, 90, 100],
})

In [39]:
additional_data

   ID  Time  Variable2  Variable3
0   1  2012         50         80
1   2  2012         60         90
2   3  2012         70        100

In [40]:
# Append the additional variables to the panel data
updated_panel_data = pd.concat([panel_data, additional_data], ignore_index=True)

# Output the updated panel data
print(updated_panel_data)

   ID  Time  Variable1  Variable2  Variable3
0   1  2010       10.0        NaN        NaN
1   1  2011       20.0        NaN        NaN
2   2  2010       15.0        NaN        NaN
3   2  2011       25.0        NaN        NaN
4   3  2010       30.0        NaN        NaN
5   3  2011       40.0        NaN        NaN
6   1  2012        NaN       50.0       80.0
7   2  2012        NaN       60.0       90.0
8   3  2012        NaN       70.0      100.0

In [41]:
import pandas as pd

# Create the initial panel data frame
panel_data = pd.DataFrame({
    'ID': [1, 1, 2, 2, 3, 3],
    'Time': [2010, 2011, 2010, 2011, 2010, 2011],
    'Variable1': [10, 20, 15, 25, 30, 40],
})

In [42]:
panel_data

   ID  Time  Variable1
0   1  2010         10
1   1  2011         20
2   2  2010         15
3   2  2011         25
4   3  2010         30
5   3  2011         40

In [46]:
# Create a new row to append
new_row = pd.DataFrame({
    'ID': [1],
    'Time': [2012],
    'Variable1': [50],
})

In [47]:
new_row

   ID  Time  Variable1
0   1  2012         50

In [52]:
df = updated_panel_data.sort_values(by=['ID'])
df

   ID  Time  Variable1
0   1  2010         10
1   1  2011         20
6   1  2012         50
2   2  2010         15
3   2  2011         25
4   3  2010         30
5   3  2011         40

In [50]:
# Append the new row to the panel data
updated_panel_data = pd.concat([panel_data, new_row], ignore_index=True)

# Output the updated panel data
print(updated_panel_data)

   ID  Time  Variable1
0   1  2010         10
1   1  2011         20
2   2  2010         15
3   2  2011         25
4   3  2010         30
5   3  2011         40
6   1  2012         50